{"pageProps":{"places":[{"title":"Lamb & Black (램앤블랙)","rating":"favorite","kind":"food","description":"The lamb here is amazing, but the green onion cod roe rice really stole the show for me. Our waitress spoke good English and was extremely friendly and attentive. I would highly recommend even though it’s a bit out of the way.","date":"2022-10"},{"title":"Sukseongdo (숙성도)","rating":"favorite","kind":"food","description":"This was probably the best kbbq I’ve had in my life. The black pork was delicious, and the workers are helpful and friendly. We came twice while we were in Jeju. \n\nThe first time we came at 4:30pm and waited 40 mins. The second time we came an hour before opening and got seated 10 mins after opening. \n\nSome of the speciality meats sell out in the afternoon, but we thought the normal meats were just as good if not better than the limited meats.","date":"2022-10"},{"title":"Cheonjiyeon Waterfall (천지연폭포)","rating":"recommended","kind":"activities","description":"The walk to see this waterfall is pretty scenic and peaceful. ","date":"2022-10"},{"title":"Greem Cafe (제주그림카페)","rating":"recommended","kind":"cafe","description":"Cafe that looks like a 2D sketch. Really fun to take photos in. Near Osulloc.","date":"2022-10"},{"title":"Innisfree Jeju House (이니스프리 제주하우스)","rating":"recommended","kind":"cafe","description":"Really aesthetic store + cafe that's next to Osulloc. ","date":"2022-10"},{"title":"Jeongbang Waterfall (정방폭포)","rating":"recommended","kind":"activities","description":"There's a lot of waterfalls in Jeju. I thought this one was the coolest because it's right next to the ocean.","date":"2022-10"},{"title":"Jeongnang (정낭식당)","rating":"recommended","kind":"food","description":"The grilled hairtail (aka beltfish, aka cutlass fish) here was the best I've ever had. I did not know hairtail could taste this good before this meal.\n\nWe picked this place randomly so I feel like most restaurants in Jeju probably have great hairtail.","date":"2022-10"},{"title":"Kimnyeong Maze Park (김녕미로공원)","rating":"recommended","kind":"activities","description":"It's an actually kinda tricky maze, and there are a ton of cats hanging around.","date":"2022-10"},{"title":"Orda (오르다카페)","rating":"recommended","kind":"cafe","description":"Really good views. They have a staircase that leads to the sky that you can take pictures on.","date":"2022-10"},{"title":"Osulloc Tea Museum (오설록 티 뮤지엄)","rating":"recommended","kind":"cafe","description":"The museum and food were both a little disappointing. The museum is pretty small, and there isn’t much to see. The food looks aesthetic, but isn’t actually very tasty. We tried almost all the desserts, and I didn’t think any of them were very good besides the soft serve and the hot tea. The cold drinks we got were especially not very good. It’s probably still worth to come once and try it, but don’t have high expectations.\n","date":"2022-10"},{"title":"Sushi Akari (스시아카리)","rating":"recommended","kind":"food","description":"Really good omakase. The view is also phenomenal. I liked how they added some local touches such as uni from Udo or hairtail. \n\nWe asked our hotel front desk to help us make a reservation.","date":"2022-10"},{"title":"Udo (우도)","rating":"recommended","kind":"activities","description":"Pretty touristy, but probably my favorite thing I did on Jeju. You can get to Udo via ferry. We rented e-bikes and biked around the island. It only takes ~2 hours to circle Udo on an e-bike.","date":"2022-10"}],"city":{"abbr":"jeju","name":"Jeju","imgPosition":"none","color":"#747d8c"}},"__N_SSG":true}