{"pageProps":{"places":[{"title":"Kona Coffee Purveyors","rating":"recommended","kind":"snacks","description":"The coffee is fine. The gem is that they serve pastries from (in the style of?) b. patisserie. The kouign amann is quite good.\n","date":"2021-07"},{"title":"Opal Thai","rating":"recommended","kind":"dinner","description":"Kind of cool. The head chef takes a survey on what the table likes and doesn't like and makes food from there. He's very opinionated.\n","date":"2021-07"},{"title":"Rental Car","rating":"recommended","kind":"transit","description":"Transit more or less doesn't exist. There's _The Bus_, but service is infrequent and inconvenient.\n\nUnless you're exclusively doing things in Waikiki, getting a car seems to be an unfortunate necessity.\n","date":"2021-07"},{"title":"Aweoweo Beach","rating":"recommended","kind":"activities","description":"Kind of hidden, though we happened to live behind this beach. When the waves weren't rough, it's good for snorkeling. We saw a family of turtles here a couple of times.\n","date":"2021-12"},{"title":"Don Quixote","rating":"recommended","kind":"activities","description":"Your one-stop shop for anything you could possible need on a trip. It's like a Japanese Wal-mart.\n\nThe only bad thing I can say about this place is that they don't play the [theme song](https://www.youtube.com/watch?v=1zl88Aieecw&t=45s).\n","date":"2021-12"},{"title":"Hanauma Bay","rating":"recommended","kind":"activities","description":"A bit of a hassle to get into. You need timed-entry tickets a couple days beforehand.\n\nBeach itself is nice but rather crowded. You can see a lot of fish here. A lot of families come here it seems.\n","date":"2021-12"},{"title":"Island Vintage Coffee","rating":"recommended","kind":"lunch","description":"I don't like acai bowls, but I like the acai bowl here. My favorite is the liliko'i moana bowl. The honey is really what makes it work for me.\n\nI have not had the coffee.\n","date":"2021-12"},{"title":"Izakaya Pau Hana Base","rating":"recommended","kind":"dinner","description":"It's not bad, but not super special. The mackerel was pretty good.\n","date":"2021-12"},{"title":"Sushi Sho","rating":"recommended","kind":"activities","description":"Unfortunately, I haven't eaten at the restaurant yet - it seems hard to get into. They sell takeout bento boxes though, that are quite good.","date":"2021-12"}],"city":{"abbr":"hnl","name":"Oahu","imgPosition":"left top","color":"#1e90ff"}},"__N_SSG":true}