{"pageProps":{"places":[{"title":"Myeongdong Kyoja (명동교자)","rating":"favorite","kind":"korean food","description":"Kalguksu. One of our favorite meals in Seoul. Their dumplings are also very good. Stephen says their kalguksu just tastes like Chinese 排骨汤. Yum.\n","date":"2022-10"},{"title":"Sushi Kanae (스시카나에)","rating":"favorite","kind":"japanese food","description":"All the pieces were delicious, especially the signature chu-toro. We came for lunch, and the price is a steal for how much sushi you get and how high quality everything is. The chef didn’t speak much English (and we didn’t speak much Korean) but he was very kind and funny.\n\nYou need a Korean phone number in order to make a reservation, so our Korean friend made one for us. You could probably also try to ask your hotel front desk or airbnb host to make a reservation for you.","date":"2022-10"},{"title":"Yeongdong Freshwater Eel (영동 민물장어)","rating":"favorite","kind":"korean food","description":"The eel here is really delicious. We got the mud water eel (the most expensive thing they had), and it was worth it. They cook the eel for you in front of you.\n","date":"2022-10"},{"title":"Baekmidang (백미당)","rating":"recommended","kind":"dessert","description":"A chain that sells soft serve. It's pretty good, worth trying. ","date":"2022-10"},{"title":"Buchon Yukhoe (부촌육회)","rating":"recommended","kind":"korean food","description":"Good place to try yukhoe (raw Korean beef) and moving octopus legs. I really liked it, but it's probably not for everyone. ","date":"2022-10"},{"title":"Cafe Haina (하인나커피)","rating":"recommended","kind":"dessert","description":"A hidden gem that we randomly stumbled across. Their mango shaved ice is amazing and very aesthetic.","date":"2022-10"},{"title":"Cheongsudang (청수당)","rating":"recommended","kind":"dessert","description":"The souffle castella here was one of the best desserts I’ve had in my life. The cafe is also very aesthetic.","date":"2022-10"},{"title":"Club K Seoul (클럽K서울)","rating":"recommended","kind":"spa","description":"Smaller than riverside. Their co-ed area is decent.","date":"2022-10"},{"title":"COEX (코엑스)","rating":"recommended","kind":"activities","description":"Huge mall full of tourists. Starfield library looks really cool. There's also an Arabica if you like coffee. ","date":"2022-10"},{"title":"곽만근갈비탕이야기","rating":"recommended","kind":"korean food","description":"Really good galbitang. I was told this place is a chain, but I was not good enough at Korean to figure out where the other locations are. ","date":"2022-10"},{"title":"Gatten Sushi (갓덴스시)","rating":"recommended","kind":"japanese food","description":"High quality conveyer belt sushi. We went to the one in the Lotte World Mall. We waited for a while, but it was worth the wait. ","date":"2022-10"},{"title":"Gwangjang Market (광장시장)","rating":"recommended","kind":"activities","description":"Huge market with a lot of food. A good place to try a variety of traditional Korean food.","date":"2022-10"},{"title":"Gyeongbokgung Palace (경복궁)","rating":"recommended","kind":"activities","description":"We did a hanbok rental + photoshoot here. The palace is really lovely, and the pictures came out really great.","date":"2022-10"},{"title":"Hwangsaengga Kalguksu (황생가칼국수)","rating":"recommended","kind":"korean food","description":"I thought the kalguksoo at Myeongdong Kyoja was better, but the mandu here was better. The kimchi here is also one of the best kimchis I’ve had in Korea so far. The store workers are friendly and welcoming. We waited about 45 mins during dinner time on a Sunday.\n","date":"2022-10"},{"title":"Katsu Hana (카츠하나)","rating":"recommended","kind":"japanese food","description":"We were craving curry katsu, and decided to try this place. Really good.","date":"2022-10"},{"title":"Kim & Kim King Crab (김앤김대게)","rating":"recommended","kind":"korean food","description":"Worth going if you like crab. The crab was delicious, but some of the other dishes were not great. We also ordered way more than we needed. They recommended 3-4kg for 4 people, but I think 2 or 2.5kg would have been a good amount for us.\n","date":"2022-10"},{"title":"Knotted (노티드)","rating":"recommended","kind":"dessert","description":"They had really tasty donuts. They run out quickly though, so go early.","date":"2022-10"},{"title":"Lotte Young Plaza (롯데영플라자)","rating":"recommended","kind":"activities","description":"We went to a lot of malls in Seoul, but this one was probably my favorite. It has a lot of trendy-feeling Korean stores, not just high end stores.","date":"2022-10"},{"title":"Lotteria (롯데리아)","rating":"recommended","kind":"korean food","description":"Bulgogi burgers. They taste kinda... interesting and are worth trying, imo. I liked it, and Stephen thought it was just okay. ","date":"2022-10"},{"title":"Minami (미나미)","rating":"recommended","kind":"japanese food","description":"A little pricey, but the soba and tempura were delicious. We also tried their tuna sobamaki because it sounded weird, but it tasted pretty good.\n","date":"2022-10"},{"title":"Okdongsik (옥동식)","rating":"recommended","kind":"korean","description":"Dwaeji gukbap (meat broth with rice and meat). The broth and meat were refreshing and really well-done.\n","date":"2022-10"},{"title":"Riverside Spa Land (강변스파랜드)","rating":"recommended","kind":"spa","description":"Pretty good spa. Lots of things to do.","date":"2022-10"},{"title":"Tosokchon Samgyetang (토속촌 삼계탕)","rating":"recommended","kind":"korean food","description":"This was the best samgyetang that I’ve had. The chicken was tender and perfectly cooked, and the soup was well seasoned and not too herbal.\n","date":"2022-10"}],"city":{"abbr":"seoul","name":"Seoul","imgPosition":"none","color":"#747d8c"}},"__N_SSG":true}